Missing Data

In [1]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[1,np.nan,np.nan],'B':[1,2,3],'C':[2,np.nan,4]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A  B    C
0  1.0  1  2.0
1  NaN  2  NaN
2  NaN  3  4.0

In [6]:
# dropna() is used to delete the rows or columns with 1 or more missing values
# By default axis=0 which deletes the rows and axis=1 deletes the rows

df.dropna()

     A  B    C
0  1.0  1  2.0

In [7]:
df.dropna(axis=1)

   B
0  1
1  2
2  3

In [11]:
# thresh option can be used to retain a row or column with a particular no. of non-na values
#thresh =2 removes all rows with a non na values more than or equal to 2
df.dropna(thresh=2)

     A  B    C
0  1.0  1  2.0
2  NaN  3  4.0

In [13]:
# To fill the missing values

df.fillna(value='Data Missing')

              A  B             C
0             1  1             2
1  Data Missing  2  Data Missing
2  Data Missing  3             4

In [17]:
# To fill the data with a meaningful value we can fill it with mean or median etc

df['C'].fillna(value=df['C'].mean())

0    2.0
1    3.0
2    4.0
Name: C, dtype: float64

In [18]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    1.0
2    1.0
Name: A, dtype: float64

Groupby

In [19]:
import numpy as np
import pandas as pd

In [25]:
data = {'Subject':['Math','Math','Science','Science','Social','Social'],'Name':['A','B','C','D','E','F'],
        'Marks':[20,18,15,18,17,18]}

In [26]:
df = pd.DataFrame(data)

In [27]:
df

   Marks Name  Subject
0     20    A     Math
1     18    B     Math
2     15    C  Science
3     18    D  Science
4     17    E   Social
5     18    F   Social

In [31]:
# Gives the location where groupby object is stored in the memory

df.groupby('Subject')

In [32]:
df.groupby('Subject').mean()

         Marks
Subject
Math      19.0
Science   16.5
Social    17.5

In [33]:
# We get a dataframe as a subset and we can perform indexing

df.groupby('Subject').sum()

         Marks
Subject
Math        38
Science     33
Social      35

In [34]:
df.groupby('Subject').sum().loc['Math']

Marks    38
Name: Math, dtype: int64

In [35]:
df.groupby('Subject').min()

         Marks Name
Subject
Math        18    A
Science     15    C
Social      17    E

In [36]:
# Statistical info can be obtained using describe()

df.groupby('Subject').describe()

        Marks
        count  mean       std   min    25%   50%    75%   max
Subject
Math      2.0  19.0  1.414214  18.0  18.50  19.0  19.50  20.0
Science   2.0  16.5  2.121320  15.0  15.75  16.5  17.25  18.0
Social    2.0  17.5  0.707107  17.0  17.25  17.5  17.75  18.0

In [37]:
df.groupby('Subject').describe().loc['Science']

Marks  count     2.00000
       mean     16.50000
       std       2.12132
       min      15.00000
       25%      15.75000
       50%      16.50000
       75%      17.25000
       max      18.00000
Name: Science, dtype: float64

In [40]:
df.groupby('Subject').describe().transpose()

Subject           Math   Science     Social
Marks count   2.000000   2.00000   2.000000
      mean   19.000000  16.50000  17.500000
      std     1.414214   2.12132   0.707107
      min    18.000000  15.00000  17.000000
      25%    18.500000  15.75000  17.250000
      50%    19.000000  16.50000  17.500000
      75%    19.500000  17.25000  17.750000
      max    20.000000  18.00000  18.000000

Operations

In [41]:
dat = {'col1':[1,2,3,4], 'col2':[111,222,333,111],'col3':['abc','def','geh','ijk']}

In [42]:
newdat= pd.DataFrame(dat)

In [43]:
newdat

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  geh
3     4   111  ijk

In [45]:
# to find the distinct values

newdat['col2'].unique()

array([111, 222, 333], dtype=int64)

In [46]:
# To find the number of unique values we can use len function or nunique function

len(newdat['col2'].unique())

3

In [47]:
newdat['col2'].nunique()

3

In [48]:
# value_counts - no of times each value is repeated

newdat['col2'].value_counts()

111    2
222    1
333    1
Name: col2, dtype: int64

In [50]:
# Apply method can be used to broadcast a custom function

# New function
def times2(x):
    return x*2

In [52]:
# To apply the function to the entire column that is to broadcast

newdat['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [53]:
newdat['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [54]:
# Instead of creating a function and then applying it we can use a lambda expression

newdat['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [55]:
# To get the names of columns in the dataframe we use

newdat.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [56]:
# To know the index we use index attribute. Since it is a number we got the range of the index
newdat.index

RangeIndex(start=0, stop=4, step=1)

In [57]:
# To sort the rows/columns based on a column we use sort_values()

newdat.sort_values('col2')

   col1  col2 col3
0     1   111  abc
3     4   111  ijk
1     2   222  def
2     3   333  geh

In [59]:
# To find the null values

newdat.isnull() #Since there are no null values we get False

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

Pivot Tables

In [61]:
x = {'A':['foo','foo','foo','bar','bar','bar'] ,'B':['one','one','two','two','one','one'],'C':['x','y','x','y','x','y'],'D':[1,5,2,6,7,8]}

In [63]:
newx = pd.DataFrame(x)

In [64]:
newx

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  5
2  foo  two  x  2
3  bar  two  y  6
4  bar  one  x  7
5  bar  one  y  8

In [65]:
newx.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  7.0  8.0
    two  NaN  6.0
foo one  1.0  5.0
    two  2.0  NaN